
[
  {
    "id": "1",
    "title": "Hackathon 360",
    "date": "November 1-3, 2024",
    "location": "Virtual",
    "description": "A 360-degree hackathon experience covering all aspects of modern development, from frontend to backend to DevOps.",
    "longDescription": "Hackathon 360 is an all-encompassing event for developers, designers, and tech enthusiasts. You'll work in teams to build a complete project from scratch, tackling challenges across the full technology stack. We provide the mentors and resources; you bring the ideas and energy.",
    "imageUrl": "",
    "imageHint": "coding collaboration",
    "organizerId": "1",
    "tags": ["Full-Stack", "Virtual", "Beginner-Friendly"]
  },
  {
    "id": "2",
    "title": "Sprintathon",
    "date": "December 10, 2024",
    "location": "San Francisco, CA",
    "description": "A high-intensity, 24-hour sprint to build and launch a functional prototype. Speed and execution are key.",
    "longDescription": "Sprintathon is not for the faint of heart. This is a fast-paced, 24-hour coding marathon where teams race against the clock to turn an idea into a working prototype. If you thrive under pressure and want to test your rapid development skills, this is the event for you. Coffee and energy drinks will be plentiful.",
    "imageUrl": "",
    "imageHint": "fast coding stopwatch",
    "organizerId": "1",
    "tags": ["Prototype", "In-Person", "Intense"]
  },
  {
    "id": "3",
    "title": "Build-a-thon",
    "date": "January 20-22, 2025",
    "location": "Virtual",
    "description": "A collaborative event focused on building open-source tools for social good. Contribute to meaningful projects.",
    "longDescription": "Join the Build-a-thon and use your skills to make a difference. This event brings together developers to contribute to open-source projects that address social and environmental challenges. It's less of a competition and more of a collaboration, with a focus on learning, community, and impact.",
    "imageUrl": "",
    "imageHint": "community building teamwork",
    "organizerId": "2",
    "tags": ["Open Source", "Social Good", "Collaboration"]
  }
]
